app/Controllers/Admin/User.php

    public function index()
    {
        $M_user = new M_user();
        $user = $M_user->findAll();
---
SELECT *
FROM `users`