app/Controllers/Users/Lldikti/Surat_tugas.php



        $surgas = $querySurgas->getResultArray();
        $pegawai = $m_pegawai->where('id_pegawai !=', 0)->findAll();

        $pegawaiverify = $m_pegawai->where('id_pegawai in(select id_pegawai from t_user_pegawai)')
            ->where('id_pegawai != "' . idPegawai() . '"')
            ->where('id_pegawai != "761c7ed7-2966-11ee-b728-503eaa456e2a"')->findAll();
---
SELECT *
FROM `t_pegawai`
WHERE `id_pegawai` != 0
SELECT *
FROM `t_pegawai`
WHERE `id_pegawai` in(select id_pegawai from t_user_pegawai)
AND `id_pegawai` != "761caa82-2966-11ee-b728-503eaa456e2a"
AND `id_pegawai` != "761c7ed7-2966-11ee-b728-503eaa456e2a"