app/Helpers/private_helper.php

SELECT *
FROM `t_user_pegawai`
WHERE `id_user` = '14'
 LIMIT 1
---
    function idPegawai()
    {
        $m_userpegawai = new M_userpegawai();
        $userId = idUser();
        if ($userId) {
            $userPegawai = $m_userpegawai->where('id_user', $userId)->first();

SELECT *
FROM `t_user_pegawai`
WHERE `id_user` = '44'
 LIMIT 1
---
    function idWilayah()
    {
        $m_userpegawai = new M_userpegawai();

        $db = db_connect();
        $m_userpegawai = new M_userpegawai();
        $userId = idUser();
        if ($userId) {
            $userPegawai = $m_userpegawai->where('id_user', $userId)->first();