app/Controllers/Users/Pts/Surat_keluarp.php

SELECT *
FROM `t_sifat`
---
  public function formTambahSuker()
  {
    $M_sifat = new M_sifat();

    $sifat = $M_sifat->findAll();