app/Models/M_verifikasi.php

    public function createVerifikasi($data)
    {
        return $this->insert($data);
---
INSERT INTO `t_verifikasi` (`id_surat`, `id_status`, `id_user`) VALUES ('f4dddf19-bbe4-4739-8172-b9d8347a70f9', '2', '14')